Repository: guilamu/gravity-forms-iban-extractor
Catalog: languages/gravity-forms-iban-extractor-*.po
Languages: fr_fr

source: Gravity Forms IBAN Extractor requires %s to be installed and activated.
fr_fr: Gravity Forms IBAN Extractor nécessite que %s soit installé et activé.

source: Valid IBAN
fr_fr: IBAN valide

source: Invalid IBAN
fr_fr: IBAN invalide

source: Validating...
fr_fr: Validation en cours...

source: Country
fr_fr: Pays

source: Currency
fr_fr: Devise

source: Bank Code
fr_fr: Code banque

source: Branch Code
fr_fr: Code agence

source: Account No.
fr_fr: N° de compte

source: Enter an IBAN to validate
fr_fr: Entrez un IBAN à valider

source: Did you mean:
fr_fr: Vouliez-vous dire :

source: Scan Document for IBAN
fr_fr: Scanner un document pour extraire l'IBAN

source: Scanning document...
fr_fr: Analyse du document...

source: IBAN extracted successfully
fr_fr: IBAN extrait avec succès

source: Could not extract IBAN from document
fr_fr: Impossible d'extraire l'IBAN du document

source: Please upload a PDF, PNG, JPG, or WEBP file
fr_fr: Veuillez télécharger un fichier PDF, PNG, JPG ou WEBP

source: File size must be less than 10MB
fr_fr: La taille du fichier doit être inférieure à 10 Mo

source: Drop document here
fr_fr: Déposez le document ici

source: or click to browse
fr_fr: ou cliquez pour parcourir

source: Extracted Information
fr_fr: Informations extraites

source: Account Holder
fr_fr: Titulaire du compte

source: Bank Name
fr_fr: Nom de la banque

source: Remove
fr_fr: Supprimer

source: Please enter an IBAN.
fr_fr: Veuillez entrer un IBAN.

source: Invalid IBAN format.
fr_fr: Format d'IBAN invalide.

source: Invalid field or form ID.
fr_fr: Identifiant de champ ou de formulaire invalide.

source: Form not found.
fr_fr: Formulaire non trouvé.

source: Field not found.
fr_fr: Champ non trouvé.

source: API key not configured.
fr_fr: Clé API non configurée.

source: AI model not configured.
fr_fr: Modèle IA non configuré.

source: No file uploaded.
fr_fr: Aucun fichier téléversé.

source: Invalid file type. Please upload PDF, PNG, JPG, or WEBP.
fr_fr: Type de fichier invalide. Veuillez télécharger un fichier PDF, PNG, JPG ou WEBP.

source: File too large. Maximum size is 10MB.
fr_fr: Fichier trop volumineux. La taille maximale est de 10 Mo.

source: Extraction failed.
fr_fr: L'extraction a échoué.

source: Security check failed.
fr_fr: Vérification de sécurité échouée.

source: Permission denied.
fr_fr: Permission refusée.

source: API key is required.
fr_fr: La clé API est requise.

source: PDF processing requires Imagick PHP extension.
fr_fr: Le traitement PDF nécessite l'extension PHP Imagick.

source: Failed to process PDF:
fr_fr: Échec du traitement du PDF :

source: 🐛 Report a Bug
fr_fr: 🐛 Signaler un bug

source: IBAN Extractor
fr_fr: Extracteur IBAN

source: IBAN validation results
fr_fr: Résultats de validation IBAN

source: This field is required.
fr_fr: Ce champ est obligatoire.

source: Invalid IBAN format. Did you mean: %s?
fr_fr: Format d'IBAN invalide. Vouliez-vous dire : %s ?

source: Please enter a valid IBAN.
fr_fr: Veuillez entrer un IBAN valide.

source: Country:
fr_fr: Pays :

source: Currency:
fr_fr: Devise :

source: Bank Code:
fr_fr: Code banque :

source: Account No.:
fr_fr: N° de compte :

source: Scan document for IBAN
fr_fr: Scanner un document pour extraire l'IBAN

source: Accepted file types: pdf, png, jpeg, webp.
fr_fr: Types de fichiers acceptés : pdf, png, jpeg, webp.

source: Display Options
fr_fr: Options d'affichage

source: Show Account No.
fr_fr: Afficher le N° de compte

source: Show BBAN
fr_fr: Afficher le BBAN

source: Show Country Currency
fr_fr: Afficher la devise du pays

source: Show Country Name
fr_fr: Afficher le nom du pays

source: Show BIC/Bank Code
fr_fr: Afficher le BIC/Code banque

source: Show Bank Info
fr_fr: Afficher les infos bancaires

source: Enable Real-time Preview
fr_fr: Activer l'aperçu en temps réel

source: Document Extraction
fr_fr: Extraction de document

source: Enable Document Scanning
fr_fr: Activer la numérisation de document

source: API Provider
fr_fr: Fournisseur d'API

source: Select which AI provider to use for document extraction.
fr_fr: Sélectionnez le fournisseur d'IA à utiliser pour l'extraction de documents.

source: POE API Key
fr_fr: Clé API POE

source: Get your API key from poe.com
fr_fr: Obtenez votre clé API sur poe.com

source: POE AI Model
fr_fr: Modèle IA POE

source: -- Select Model --
fr_fr: -- Sélectionner un modèle --

source: Load Models
fr_fr: Charger les modèles

source: Gemini API Key
fr_fr: Clé API Gemini

source: Get your API key from Google AI Studio
fr_fr: Obtenez votre clé API sur Google AI Studio

source: Gemini AI Model
fr_fr: Modèle IA Gemini

source: Select which extracted IBAN data fields to display below the input.
fr_fr: Sélectionnez les champs de données IBAN extraits à afficher sous le champ de saisie.

source: Real-time Preview
fr_fr: Aperçu en temps réel

source: Enable live validation and data extraction as the user types.
fr_fr: Activer la validation et l'extraction des données en temps réel pendant la saisie.

source: Allow users to upload a document (PDF, image) to automatically extract the IBAN using AI.
fr_fr: Permettre aux utilisateurs de télécharger un document (PDF, image) pour extraire automatiquement l'IBAN à l'aide de l'IA.

source: Please enter an API key first.
fr_fr: Veuillez d'abord entrer une clé API.

source: Loading...
fr_fr: Chargement...

source: Loaded!
fr_fr: Chargé !

source: Error loading models.
fr_fr: Erreur lors du chargement des modèles.

source: Request failed.
fr_fr: La requête a échoué.

source: Account Holder:
fr_fr: Titulaire du compte :

source: Bank Name:
fr_fr: Nom de la banque :

source: Extracted IBAN:
fr_fr: IBAN extrait :

source: Source Document:
fr_fr: Document source :

source: View Document
fr_fr: Voir le document

source: API key is required
fr_fr: La clé API est requise

source: Model is required
fr_fr: Le modèle est requis

source: Image is required
fr_fr: L'image est requise

source: API returned status %d
fr_fr: L'API a retourné le statut %d

source: Failed to parse API response
fr_fr: Impossible d'analyser la réponse de l'API

source: Invalid API response
fr_fr: Réponse API invalide

source: Could not parse extraction response
fr_fr: Impossible d'analyser la réponse d'extraction

source: No IBAN found in the document
fr_fr: Aucun IBAN trouvé dans le document
